import Image from "next/image";

export default function About(){
    return (
      <section className=" container section-dark my-5 px-16 py-10">
        <div className="w-full text-center p-10">
          <h2 className="text-3xl font-bold p-4">يضم مكتب محمود حسن عبدو</h2>
          <p>
            فريقًا مؤهلاً تأهيلاً عاليًا من المحامين والمستشارين القانونيين المحترفين ويعتبر من المكاتب الرائدة في دولة
            الإمارات العربية المتحدة
          </p>
        </div>
        <div className="flex justify-between items-center gap-10 ">
          <div className="flex-1 pr-8">
            <p>مكتب محمود حسن عبده للمحاماة يقدم استشارات قانونية علي مستوى الإمارات</p>
            <h2>نحن الحـل القانــوني الأمثل لك</h2>
            <p>
              ملتزمون بتلبية الاحتياجات الفريدة لعملائنا من خلال تقديم نموذج خدمة قانونية استثنائي يقدم قيمة حقيقية. نحن
              ندرك أن القيمة بالنسبة لعملائنا تمتد إلى ما هو أبعد من مقارنة الأسعار بالساعة. ويعني ذلك عمليات مبسطة
              للتتبع وإعداد التقارير، واستراتيجيات مبتكرة للتخفيف من المخاطر القانونية، وتحسين القدرة على التنبؤ
              بالتكاليف، والأهم من ذلك، تحقيق نتائج ملموسة
            </p>

            <ul>
              <li>يتمحور نهجنا حول احتياجات العملاء</li>
              <li>نحن نحتضن المرونة والقيمة</li>
              <li>نبقي عملائنا على علم بالمخاطر القانونية</li>
              <li>يضم فريقنا محامين متمرسين ومتخصصين</li>
            </ul>
            <button>استشارات قانونية</button>
          </div>
          <div className="flex-1">
            <Image src="/pexels-tahaasamett-7781900.jpg" alt="محامي" width={500} height={500} />
          </div>
        </div>
      </section>
    );
}